/* appended to region name when merging regions */
" merged" = " yhdistetty";

/* appended to region name of mixed down regions */
" mixed" = " miksattu";

/* Disk Full Alert: see Ke6 */
"%@ needed|%@ available." = "%@ tarvitaan|%@ käytettävissä.";

/* cd/dvd media status, media is empty/blank */
"(blank)" = "(tyhjä)";

/* cd/dvd media status, media is not empty/blank */
"(NOT blank)" = "(EI tyhjä)";

/* Alert */
"[1][%@ is not available.][OK]" = "[1][%@ ei ole käytettävissä.][OK]";

/* DAE */
"[1][%@ Plug-ins not available.][OK]" = "[1][%@ liitännäistä ei käytettävissä.][OK]";

/* Audio Configuration */
"[1][%@: Plug-in \\U201C%@\\U201D%@%@ not available!][OK]" = "[1][%@: liitännäinen ”%@”%@%@ ei käytettävissä!][OK]";

/* Audio Configuration */
"[1][%@: Plug-in \\U201C%@\\U201D%@%@ not available!][OK|\\U221ADon\\U2019t show again]" = "[1][%@: Liitännäinen ”%@”%@%@ ei ole käytettävissä!][OK|√Älä näytä enää]";

/* Alert */
"[1][%@:|^P is not able to allocate enough memory for the required %ld audio tracks.|Only %ld audio tracks are available.|%@ of additional free system memory is needed.][OK]" = "[1][%@:|^P ei voi varata tarpeeksi muistia halutulle %ld ääniraidalle.|Käytettävissä on vain %ld ääniraitaa.|Vapaata järjestelmämuistia tarvitaan %@ lisää.][OK]";

/* Alert */
"[1][%@:|Sample Rate %ld not allowed.][OK]" = "[1][%@:|Näytetaajuus %ld ei ole sallittu.][OK]";

/* EXS24 */
"[1][%ld of %ld audio file(s) were not found.|Still %@ the found audio files?][Cancel|Do it]" = "[1][%ld / %ld äänitiedostoa ei löytynyt.|Haluatko silti %@ löydetyt äänitiedostot?][Kumoa|Kyllä]";

/* EXS24 */
"[1][%ld of %ld audio files are not found.|(\\U201C%@\\U201D,...)][Continue]" = "[1][%ld / %ld äänitiedostoa ei löytynyt.|(”%@”,...)][Jatka]";

/* Alert */
"[1][\\U201C%@\\U201D can\\U2019t be played back on Track %ld from drive/partition \\U201C%@\\U201D][OK|\\U221ADon\\U2019t show again]" = "[1][Kohdetta ”%@” ei voida toistaa raidalla %ld asemalta/osiolta ”%@”][OK|√Älä näytä enää]";

/* Alert */
"[1][\\U201C%@\\U201D from drive/partition \\U201C%@\\U201D can not be used.|Drive/partition not allowed!][OK|\\U221ADon\\U2019t show again]" = "[1][Kohdetta ”%@” asemalta/osiolta ”%@” ei voida käyttää.|Asemaa/osiota ei sallita!][OK|√Älä näytä enää]";

/* Alert */
"[1][\\U201C%@\\U201D from drive/partition \\U201C%@\\U201D can not be used.|Drive/partition not allowed!][OK|Load]" = "[1][Kohdetta ”%@” asemalta/osiolta ”%@” ei voida käyttää.|Asemaa/osiota ei sallita!][OK|Lataa]";

/* Alert */
"[1][\\U201C%@\\U201D is a %ld bit file and can\\U2019t be played back thru %@.][OK]" = "[1][”%@” on %ld-bittinen tiedosto eikä sitä voida toistaa kohteen %@ kautta.][OK]";

/* Bin: trying to add an audio file */
"[1][\\U201C%@\\U201D is already included!][Cancel]" = "[1][”%@” on jo mukana!][Kumoa]";

/* Alert */
"[1][\\U201C%@\\U201D is empty!][Cancel]" = "[1][”%@” on tyhjä!][Kumoa]";

/* Audio Configuration */
"[1][\\U201C%@\\U201D is not a standard PCM Wave format audio file.][OK]" = "[1][”%@” ei ole normaali PCM Wave -muotoinen äänitiedosto.][OK]";

/* Alert */
"[1][\\U201C%@\\U201D or \\U201C%@\\U201D already exists!][Use|Replace]" = "[1][”%@” tai ”%@” on jo olemassa!][Käytä|Korvaa]";

/* Alert */
"[1][^P found %ld audio file(s) in %ld bit format.|This format is unsupported and cannot be played back.][OK|\\U221ADon\\U2019t show again]" = "[1][^P löysi %ld äänitiedosto(n/a) %ld-bittisessä muodossa.|Tätä muotoa ei tueta eikä sitä voida toistaa.][OK|√Älä näytä enää]";

/* Changed text. Still missing: J, F, E */
"[1][^P is scanning your system for audio devices, and has detected a device named \\U201C%@\\U201D.|If you want to use this device, do not disconnect it during the scanning process.|Do you want to use this device?][Yes|No]" = "[1][^P etsii järjestelmästä äänilaitteita ja löysi laitteen nimeltä ”%@”.|Jos haluat käyttää tätä laitetta, älä irrota sitä etsimisen aikana.|Haluatko käyttää tätä laitetta?][Kyllä|Ei]";

/* EXS24 */
"[1][Abort?][Continue|Abort]" = "[1][Keskeytä?][Jatka|Keskeytä]";

/* Alert */
"[1][Already recording...][OK]" = "[1][Äänitys käynnissä...][OK]";

/* Alert */
"[1][An error occurred.||Result code = %ld][OK]" = "[1][Tapahtui virhe.||Tuloskoodi on %ld][OK]";

/* Alert */
"[1][An error occurred.||Result code = %ld||File = %@][OK]" = "[1][Tapahtui virhe.||Tuloskoodi on %ld||Tiedosto = %@][OK]";

/* Alert */
"[1][Audio %@ %@ can not be used to playback \\U201C%@\\U201D from drive/partition \\U201C%@\\U201D][OK]" = "[1][Äänen %@ %@ ei voi toistaa kohdetta ”%@” asemalta/osiolta ”%@”][OK]";

/* Alert */
"[1][Audio file \\U201C%@\\U201D not found!]%@" = "[1][Äänitiedostoa ”%@” ei löytynyt!]%@";

/* Alert */
"[1][Audio Unit authorization error.|The Audio Unit \\U201C%@\\U201D by \\U201C%@\\U201D reports that it is not properly authorized to be used on this system.|Please check the plug-in's documentation for more information about its copy protection.][OK]" = "[1][Audio Unitin valtuutusvirhe.|Audio Unit ”%@” / ”%@” raportoi, että sitä ei ole valtuutettu käytettäväksi tässä järjestelmässä.|Katso lisätietoja liitännäisen kopiosuojauksesta liitännäisen dokumentaatiosta.][OK]";

/* appears when a user loads a bad AU */
"[1][Audio Unit Compatibility Error|The Audio Unit \\U201C%@\\U201D by \\U201C%@\\U201D does not fully comply with the Audio Units standard.|^P cannot save or load the plug-in's settings, nor can they be saved with the song.|The settings will be lost when closing the song.][OK]" = "[1][Audio Unitin yhteensopivuusvirhe|Audio Unit ”%@” / ”%@” ei ole täysin Audio Unit -standardin mukainen.|^P ei voi tallentaa tai ladata liitännäisen asetuksia eikä niitä voida tallentaa kappaleen kanssa.|Asetukset menetetään, kun kappale suljetaan.][OK]";

/* HyperDraw / Automation */
"[1][Automation Parameter Error!|%ld][OK]" = "[1][Automaatioparametrivirhe.|%ld][OK]";

/* EXS24 */
"[1][Can\\U2019t delete instrument \\U201C%@\\U201D.|It is currently in use.][Cancel]" = "[1][Instrumenttia ”%@” ei voida poistaa.|Se on tällä hetkellä käytössä.][Kumoa]";

/* EXS24 */
"[1][Can\\U2019t find audio file \\U201C%@\\U201D.][OK|\\U221ADon\\U2019t show again]" = "[1][Äänitiedostoa ”%@” ei löydy.][OK|√Älä näytä uudelleen]";

/* EXS24 */
"[1][Can\\U2019t load Sampler Instrument \\U201C%@\\U201D.|It was created with a newer EXS24 version.][Continue|\\U221ADon\\U2019t show again]" = "[1][Sampler-instrumenttia ”%@” ei voida ladata.|Se on luotu uudemmalla EXS24-versiolla.][Jatka|√Älä näytä enää]";

/* ALP Version Alert Text */
"[1][Chord Track added to %d Apple Loop files.][OK]" = "[1][Sointuraita lisättiin %d Apple Loop -tiedostoon.][OK]";

/* ALP Version Alert Text */
"[1][Couldn't find Chord Progression data in file %@!][OK]" = "[1][Tiedostosta ”%@” ei löytynyt sointukulkudataa!][OK]";

/* ALP Version Alert Text */
"[1][Couldn't open file %@ for reading!][OK]" = "[1][Tiedostoa %@ ei voitu avata lukemista varten!][OK]";

/* ALP Version Alert Text */
"[1][Couldn't open file %@ for writing!][OK]" = "[1][Tiedostoa %@ ei voitu avata kirjoittamista varten!][OK]";

/* Alert */
"[1][Couldn\\U2019t create Region.|Out of memory][Cancel]" = "[1][Aluetta ei voitu luoda.|Muisti on lopussa][Kumoa]";

/* Alert */
"[1][Couldn\\U2019t create track.|Maximum number of tracks exceeded!][Abort]" = "[1][Raitaa ei voida luoda.|Raitojen maksimimäärä on käytössä!][Keskeytä]";

/* Alert */
"[1][Do you also want to edit the automation data?][Don\\U2019t edit|Edit|\\U221ADon\\U2019t show again]" = "[1][Haluatko myös muokata automaatiotietoja?][Älä muokkaa|Muokkaa|√Älä näytä enää]";

/* Alert */
"[1][Do you want to copy the automation data?][Don\\U2019t copy|Copy|\\U221ADon\\U2019t show again]" = "[1][Haluatko kopioida automaatiotiedot?][Älä kopioi|Kopioi|√Älä näytä enää]";

/* Alert */
"[1][Do you want to delete all automation data of the whole project?|Are you sure? This operation cannot be undone.][Cancel|Delete]" = "[1][Haluatko varmasti poistaa kaiken automaatiodatan koko projektista?|Toimintoa ei voida perua.][Kumoa|Poista]";

/* Alert */
"[1][Do you want to erase the automation data?][Don\\U2019t Erase|Erase|\\U221ADon\\U2019t show again]" = "[1][Haluatko poistaa automaatiotiedot?][Älä poista|Poista|√Älä näytä enää]";

/* Alert */
"[1][Do you want to move the automation data?][Don\\U2019t Move|Move|\\U221ADon\\U2019t show again]" = "[1][Haluatko siirtää automaatiotiedot?][Älä siirrä|Siirrä|√Älä näytä enää]";

/* Alert */
"[1][Do you want to process the automation data also?][Cancel|Process]" = "[1][Haluatko käsitellä myös automaatiotiedot?][Kumoa|Käsittele]";

/* Alert */
"[1][Drive/partition \\U201C%@\\U201D can not be used for audio recording with %@.][OK]" = "[1][Asemaa/osiota ”%@” ei voida käyttää äänen tallentamiseen kohteen ”%@” kanssa.][OK]";

/* Alert */
"[1][Drive/partition \\U201C%@\\U201D can not be used for audio recording.][OK]" = "[1][Asemaa/osiota ”%@” ei voida käyttää äänen tallentamiseen.][OK]";

/* Alert */
"[1][Drive/partition \\U201C%@\\U201D can not be used to record on audio track %ld.][OK]" = "[1][Asemaa/osiota ”%@” ei voida käyttää tallentamiseen ääniraidalla %ld.][OK]";

/* Alert */
"[1][Drive/partition \\U201C%@\\U201D is full.][OK]" = "[1][Asema/osio ”%@” on täynnä.][OK]";

/* Audio error message template (error number only) */
"[1][Error code %ld was returned by the %@ driver.][Continue]" = "[1][Virhekoodi %ld palautui ajurilta %@.][Jatka]";

/* Alert */
"[1][Error during copy of Resources. %ld][OK]" = "[1][Resursseja kopioitaessa tapahtui virhe. %ld][OK]";

/* Alert */
"[1][Error in CoreMidi:|%ld][OK]" = "[1][Virhe CoreMidissä:|%ld][OK]";

/* Alert */
"[1][Error when loading project][OK]" = "[1][Projektia ladattaessa tapahtui virhe.][OK]";

/* Audio Sync */
"[1][Error while trying to synchronize Audio and MIDI.][Continue]" = "[1][Virhe yritettäessä synkronoida ääntä ja MIDIä.][Jatka]";

/* Audio Sync */
"[1][Error while trying to synchronize Audio and MIDI.|Sample Rate %ld recognized.|%@][Continue%@]" = "[1][Synkronoitaessa ääntä ja MIDI:ä tapahtui virhe.|Näytetaajuus %ld tunnistettu.|%@][Jatka%@]";

/* Alert */
"[1][Error!|Cannot open project.|This project seems to be damaged.][Cancel]" = "[1][Virhe!|Projektia ei voida avata.|Projekti on vioittunut.][Kumoa]";

/* Alert */
"[1][Error|CSong::CreateSeq - Illegal block size][OK]" = "[1][Virhe|CSong::CreateSeq - Virheellinen lohkokoko][OK]";

/* Alert */
"[1][EXS24 instrument \\U201C%@\\U201D:|Audio file \\U201C%@\\U201D not found!][Search again|Continue]" = "[1][EXS24-instrumentti ”%@”:|Äänitiedostoa ”%@” ei löytynyt!][Etsi uudelleen|Jatka]";

/* Alert message */
"[1][Found Take Folder %@ with %ld problems. Delete it?][Cancel|Delete]" = "[1][Löydettiin ottokansio ”%@”, jossa on %ld ongelmaa. Poistetaanko se?][Kumoa|Poista]";

/* Alert */
"[1][Illegal signature(1)][Cancel]" = "[1][Laiton tahtilaji(1)][Kumoa]";

/* Alert */
"[1][Illegal track count][OK]" = "[1][Virheellinen raitojen lukumäärä][OK]";

/* Alert */
"[1][Instrument set \\U201C%@\\U201D too large! Converted only %ld of %ld entries!][Cancel]" = "[1][Instrumenttijoukko ”%@” on liian suuri! Muunnettiin vain %ld / %ld tietuetta!][Kumoa]";

/* Alert */
"[1][Internal Job-Conflict|Please restart ^P][OK]" = "[1][Sisäinen työristiriita|Käynnistä ^P uudelleen][OK]";

/* Alert */
"[1][Maximum file size of %@ exceeded.|Please choose a shorter bounce time.][OK]" = "[1][Tiedoston enimmäiskoko %@ ylitettiin.|Valitse lyhyempi palautusaika.][OK]";

/* Alert */
"[1][Memory Allocation Problem.][OK]" = "[1][Muistinvarausongelma.][OK]";

/* EXS24 */
"[1][Memory used now: %@|Memory used before: %@][OK]" = "[1][Muistia käytössä nyt: %@|Muistia käytössä aiemmin: %@][OK]";

/* Alert */
"[1][Minor correction of project data has taken place. (1)][OK]" = "[1][Projektin dataa on korjattu hieman. (1)][OK]";

/* Alert */
"[1][Mono/Stereo Conflict!][Cancel]" = "[1][Mono/Stereo-ristiriita!][Kumoa]";

/* Alert */
"[1][Mono<->Stereo conflict.|Plug-in can not be moved to this place.][OK]" = "[1][Mono<->Stereo-ristiriita.|Liitännäistä ei voida siirtää tähän paikkaan.][OK]";

/* ALP Version Alert Text */
"[1][No Apple Loop selected.][Abort]" = "[1][Yhtään Apple Loop -silmukkaa ei ole valittuna.][Keskeytä]";

/* Alert */
"[1][No audio track is record-enabled!|Click the \"R\" button on the desired track to record-enable it.][OK]" = "[1][Tallennusta ei ole sallittu millekään ääniraidalle.|Salli tallentaminen halutulle ääniraidalle painamalla R-painiketta.][OK]";

/* Alert */
"[1][Non-contiguous audio regions require the creation of a new audio file!][Cancel|Create]" = "[1][Jatkumattomat äänialueet vaativat uuden äänitiedoston luomisen!][Kumoa|Luo]";

/* Alert */
"[1][Not enough memory (%ld).][OK]" = "[1][Liian vähän muistia (%ld).][OK]";

/* Time Stretching */
"[1][Not enough memory for requested DSP function][Cancel]" = "[1][Ei tarpeeksi muistia pyydetylle DSP-funktiolle.][Kumoa]";

/* Alert */
"[1][Not enough memory to convert song!][Cancel]" = "[1][Ei tarpeeksi muistia kappaleen muuntamiseen!][Kumoa]";

/* HyperDraw / Automation */
"[1][Not enough memory to create Track Automation data.][Cancel]" = "[1][Muistia ei ole tarpeeksi raidan automaatiotietojen luomiseen.][Kumoa]";

/* Alert */
"[1][Not enough space on Volume \\U201C%@\\U201D|%@][OK]" = "[1][Ei riittävästi tilaa taltiolla ”%@”|%@][OK]";

/* 	 */
"[1][Note: the \\U201CProcessor Performance\\U201D is set to \\U201CAutomatic\\U201D.|It is recommended to set this preference to \\U201CHighest\\U201D.|To change this setting please open \\U201CSystem Preferences\\U201D > \\U201CEnergy Saver\\U201D > \\U201COptions\\U201D.][Continue]" = "[1][Huomaa: Prosessorin suoritus -asetuksena on Automaattinen.|Suositeltava asetus on Korkein.|Voit muuttaa asetusta valitsemalla Järjestelmäasetukset > Energiansäästäjä > Valinnat.][Jatka]";

/* 	 */
"[1][Note: the \\U201CProcessor Performance\\U201D is set to \\U201CReduced\\U201D.|It is recommended to set this preference to \\U201CHighest\\U201D.|To change this setting please open \\U201CSystem Preferences\\U201D > \\U201CEnergy Saver\\U201D > \\U201COptions\\U201D.][Continue]" = "[1][Huomaa: Prosessorin suoritus -asetuksena on Alennettu.|Suositeltava asetus on Korkein.|Voit muuttaa asetusta valitsemalla Järjestelmäasetukset > Energiansäästäjä > Valinnat.][Jatka]";

/* Alert */
"[1][One or multiple audio files changed in length!|As a result, %ld audio regions changed in length or content position.][OK]" = "[1][Yhden tai useamman äänitiedoston pituus muuttui!|Sen seurauksena %ld äänialueen pituus tai sisällön sijainti muuttui.][OK]";

/* Alert */
"[1][One or multiple audio files changed in length!|As a result, one audio region changed in length or content position.][OK]" = "[1][Yhden tai useamman äänitiedoston pituus muuttui!|Sen seurauksena yhden äänialueen pituus tai sisällön sijainti muuttui.][OK]";

/* Alert */
"[1][Out of Memory!][Cancel]" = "[1][Muisti on lopussa!][Kumoa]";

/* Alert */
"[1][Out of Memory!|(Audio organize 1)][Continue]" = "[1][Muisti on lopussa!|(Äänen organisointi 1)][Jatka]";

/* Alert */
"[1][Out of memory!|^P needs more memory to display Waveforms.][Continue]" = "[1][Muisti on lopussa!|^P tarvitsee lisämuistia aaltomuotojen esittämiseen.][Jatka]";

/* Alert */
"[1][Out of memory!|Couldn\\U2019t insert or delete data][Cancel]" = "[1][Muisti on lopussa!|Tietoja ei voitu lisätä tai poistaa][Kumoa]";

/* Alert */
"[1][Overlapping Notes found!|Do you want to keep, to shorten or to split those?][Keep|Shorten|Split]" = "[1][Löytyi päällekkäisiä nuotteja!|Haluatko säilyttää, lyhentää vai jakaa nuotit?][Säilytä|Lyhennä|Jaa]";

/* Alert */
"[1][Overlapping Regions found!|Do you want to create Tracks for overlapped Regions?][No|Create]" = "[1][Löydettiin päällekkäisiä alueita.|Haluatko luoda raitoja päällekkäisille alueille?][Ei|Luo]";

/* Alert */
"[1][Part of the project was not played|This project has too many real instrument tracks to be played in real-time.|To optimize performance, see the 'Optimizing GarageBand performance' page in GarageBand Help.][Continue]" = "[1][Osaa projektista ei toistettu|Projektissa on liikaa oikeita instrumenttiraitoja reaaliaikaista toistoa varten.|Voit parantaa suorituskykyä tutustumalla GarageBand-ohjeiden GarageBandin suorituskyvyn parantaminen -sivuun.][Jatka]";

/* Alert */
"[1][Playback has been affected|The playback of your project has been interrupted due to change in your systems audio inputs or outputs.][Continue]" = "[1][Toisto on keskeytynyt|Projektin toisto on keskeytynyt, koska järjestelmän äänitulot tai -lähdöt ovat muuttuneet.][Jatka]";

/* Alert */
"[1][Please select an audio driver in the following preference dialog.][Continue]" = "[1][Valitse ääniajuri seuraavassa valintaikkunassa.][Jatka]";

/* Alert */
"[1][Please select the bit depth for this project.][16|24]" = "[1][Valitse projektin bittisyvyys.][16|24]";

/* Alert */
"[1][Read error!|Illegal format of file][Abort]" = "[1][Lukuvirhe!|Laiton tiedostomuoto][Keskeytä]";

/* Alert */
"[1][Record drive/partition \\U201C%@\\U201D not found!][OK]" = "[1][Tallennusasemaa/-osiota ”%@” ei löytynyt!][OK]";

/* Alert */
"[1][Record folder \\U201C%@\\U201D not found on drive/partition \\U201C%@\\U201D.][OK]" = "[1][Tallennuskansiota ”%@” ei löytynyt asemalta/osiolta ”%@”.][OK]";

/* Time Stretching */
"[1][Requested DSP function is unknown.][OK]" = "[1][Pyydetty DSP-funktio on tuntematon.][OK]";

/* alert text */
"[1][ReWire device \\U201C%@\\U201D could not be opened.|You need to launch ^P first.][OK]" = "[1][ReWire-laitetta ”%@” ei voitu avata.|^P on avattava ensin.][OK]";

/* Alert */
"[1][Running out of Regions][Cancel]" = "[1][Alueet vähissä][Kumoa]";

/* EXS24 */
"[1][Sampler:|Not enough memory to load all samples of instrument \\U201C%@\\U201D.][Continue]" = "[1][Sampler:|Liian vähän muistia instrumentin ”%@” näytteiden lataamiseen.][Jatka]";

/* EXS24 */
"[1][Sampler:|Not enough memory to open instrument \\U201C%@\\U201D.][Continue]" = "[1][Sampler:|Ei tarpeeksi muistia instrumentin ”%@” avaamiseksi.][Jatka]";

/* GB version of KfZ. J, F and E still missing. (Kf/) */
"[1][Scanning Audio Units.|^P will now scan %ld installed Audio Units plug-ins. This may take some time. This scan only occurs the first time you open ^P or after installing new Audio Units.][OK]" = "[1][Etsitään Audio Uniteja.|^P etsii %ld asennettua Audio Unit -liitännäistä. Tämä saattaa kestää jonkin aikaa. Etsintä suoritetaan vain kun ^P avataan ensimmäisen kerran ja uusien Audio Uniteiden asentamisen jälkeen.][OK]";

/* Logic ALP Version specific */
"[1][Signature %/% not recognized by @|Defaulting to 4/4.][OK|Cancel]" = "[1][@ ei tunnistanut tahtilajia %/%|Käytetään oletusarvoa 4/4.][OK|Kumoa]";

/* Alert */
"[1][Some Events have been set to minimal or maximal value.][OK]" = "[1][Jotkin tapahtumat on asetettu vähimmäis- tai enimmäisarvoon.][OK]";

/* Alert */
"[1][Sorry, can\\U2019t load this project because it is created by a newer ^P version.|Please update ^P!][OK]" = "[1][Projektia ei voida avata, koska se on luotu ohjelman ^P uudemmalla versiolla.|Päivitä ^P.][OK]";

/* Alert */
"[1][Sorry. Last operation can\\U2019t be undone][Abort]" = "[1][Viimeistä toimintoa ei voida perua][Keskeytä]";

/* Alert */
"[1][Sorry.|Undo not possible.|Not enough memory.][Abort]" = "[1][|Peruminen ei ole mahdollista.|Muistia on liian vähän.][Keskeytä]";

/* Alert */
"[1][The audio device \\U201C%@\\U201D has been disconnected!|Do you want to switch to Built-in Audio or quit ^P?][Quit|Use Built-In Audio]" = "[1][Äänilaite ”%@” on irrotettu!|Haluatko vaihtaa sisäiseen ääneen vai lopettaa ohjelman ”^P”?][Lopeta|Käytä sisäistä ääntä]";

/* Alert */
"[1][The audio file \\U201C%@\\U201D has a %ld bit format and can\\U2019t be used.][Cancel]" = "[1][Äänitiedosto ”%@” on %ld-bittisessä muodossa eikä sitä voida käyttää.][Kumoa]";

/* EXS24 */
"[1][The file \\U201C%@\\U201D is not an EXS instrument file.][Cancel]" = "[1][Tiedosto ”%@” ei ole EXS-instrumenttitiedosto.][Kumoa]";

/* Audio Configuration */
"[1][The file \\U201C%@\\U201D seems to be damaged.][OK]" = "[1][Tiedosto ”%@” näyttää olevan vioittunut.][OK]";

/* Alert */
"[1][The file name \\U201C%@\\U201D is too long.|^P needs space for name extensions.|(Maximum of %ld characters)][OK]" = "[1][Tiedostonimi ”%@” on liian pitkä.|^P tarvitsee tilaa tarkenteille.|(Enintään %ld merkkiä)][OK]";

/* Bounce */
"[1][The file name is too long.][OK]" = "[1][Tiedostonimi on liian pitkä.][OK]";

/* Alert */
"[1][The number of MIDI inputs has changed.|Now %ld inputs are available.][OK]" = "[1][MIDI-syöttöjen määrä on muuttunut.|Käytettävissä on nyt %ld syöttöä.][OK]";

/* Alert */
"[1][The number of MIDI inputs has changed.|Now no input is available.][OK]" = "[1][MIDI-syöttöjen määrä on muuttunut.|Yhtään syöttöä ei ole saatavilla.][OK]";

/* Alert */
"[1][The number of MIDI inputs has changed.|Now one input is available.][OK]" = "[1][MIDI-syöttöjen määrä on muuttunut.|Saatavilla on nyt yksi syöttö.][OK]";

/* Alert */
"[1][The plug-in named \\U201C%@\\U201D isn\\U2019t available on your system.|Choose another plug-in, or quit GarageBand and install the plug-in on your computer in order to use it in the project.][OK]" = "[1][Liitännäinen nimeltä ”%@” ei ole käytettävissä järjestelmässä.|Valitse toinen liitännäinen tai lopeta GarageBand ja asenna liitännäinen tietokoneelle, jotta voit käyttää sitä projektissa.][OK]";

/* Alert */
"[1][There are some events before position '1 1 1  1'.|Move all selected tracks or put all upbeat events to position '1 1 1  1'][Move all|Upbeat|Cancel]" = "[1][Kohtaa '1 1 1  1' ennen on joitain tapahtumia.|Siirrä kaikki valitut raidat tai kaikki kohotahtitapahtumat kohtaan  '1 1 1  1'][Siirrä kaikki|Kohotahti|Kumoa]";

/* Alert */
"[1][There is automation data for the previous instrument.|Do you want to move or copy the automation data to the new instrument?][No|Copy|Move]" = "[1][Edellisen instrumentin automaatiotiedot ovat saatavilla.|Haluatko siirtää tai kopioida automaatiotiedot uudelle instrumentille?][Ei|Kopioi|Siirrä]";

/* Alert */
"[1][This Apple Loops file was created using an effect or instrument that is not available.|The plug-In \\U201C%@\\U201D is not available. To add this loop using the same sound you heard in the loop browser, option-drag the loop to a new track.][OK]" = "[1][Tämä Apple Loop -tiedosto luotiin tehosteella tai instrumentilla, joka ei ole enää käytettävissä.|Liitännäinen ”%@” ei ole käytettävissä. Jos haluat lisätä tämän silmukan samalla äänellä, jonka kuulit silmukkaselaimessa, optio-vedä silmukka uuteen raitaan.][OK]";

/* Alert */
"[1][This drive can not be used for audio.][Abort]" = "[1][Tätä levyä ei voida käyttää ääntä varten.][Keskeytä]";

/* Audio Configuration */
"[1][This file type is not supported.][Abort]" = "[1][Tiedostotyyppiä ei tueta.][Keskeytä]";

/* Alert */
"[1][This project seems to be damaged. Please open a backup version of this project.][Abort]" = "[1][Tämä projekti on vioittunut. Avaa projektin varmuuskopio.][Keskeytä]";

/* Alert */
"[1][This project was created with a newer ^P version.|%ld -> %ld][OK]" = "[1][Tämä projekti on luotu ohjelman ^P uudemmalla versiolla.|%ld -> %ld][OK]";

/* HyperDraw / Automation */
"[1][Too many automation tracks.][Cancel]" = "[1][Liian monta automaatioraitaa.][Kumoa]";

/* Alert */
"[1][Unused occupied memory block detected!|Do you want to delete it?][Cancel|Delete]" = "[1][Käyttämätön varattu muistilohko löydetty!|Haluatko poistaa sen?][Kumoa|Poista]";

/* Alert */
"[1][Warning! Memory is short!][Retry|Cancel]" = "[1][Varoitus! Muisti on vähissä!][Yritä uudelleen|Kumoa]";

/* Alert */
"[1][Warning! Not enough memory. Could not undo. Save the project and try again. If still no success try to reboot the system and open the project again.][Cancel]" = "[1][Varoitus! Muistia ei ole tarpeeksi. Toimintoa ei voida perua. Tallenna projekti ja yritä uudelleen. Jos tämä ei auta, yritä käynnistää järjestelmä ja avata projekti uudelleen.][Kumoa]";

/* Alert */
"[1][Warning! Not enough memory.|This operation cannot be undone. Do you want to continue anyways?][Cancel|Continue]" = "[1][Varoitus! Muisti on vähissä.|Toimintoa ei voida perua. Haluatko silti jatkaa?][Kumoa|Jatka]";

/* Alert */
"[1][Warning! This project was created by a newer ^P version.|This may cause problems.|Please update ^P.][OK]" = "[1][Varoitus! Projekti on luotu ohjelman ^P uudemmalla versiolla.|Tämä voi aiheuttaa ongelmia.|Päivitä ^P.][OK]";

/* Alert */
"[1][Warning! Undo memory is getting short. Deleted the %d oldest undo steps.][OK]" = "[1][Varoitus! Perumismuisti on vähissä. Poistettiin %d vanhinta perumisaskelta.][OK]";

/* Alert */
"[1][Warning!|Couldn\\U2019t complete Undo][OK]" = "[1][Varoitus!|Perumista ei voitu suorittaa loppuun][OK]";

/* Alert */
"[1][Warning!|Damaged project! (Ginst)][OK]" = "[1][Varoitus!|Vioittunut projekti. (Ginst)][OK]";

/* Alert */
"[1][Warning!|Unused Block found in project.|Please save project first.|(Code: 0x%lx)][Cancel|Delete]" = "[1][Varoitus!|Projektista löytyi käyttämätön lohko.|Tallenna projekti ensin.|(Koodi: 0x%lx)][Kumoa|Poista]";

/* Alert */
"[1][Warning.|Mac OS X MIDI Services not available.][OK]" = "[1][Varoitus.|Mac OS X MIDI -palvelut eivät ole saatavilla.][OK]";

/* Alert */
"[1][Warning:|Missing End event in project!][OK]" = "[1][Varoitus:|Projektista puuttuu lopputapahtuma!][OK]";

/* Alert */
"[1][Warning|Reentrant in multitask][OK]" = "[1][Varoitus|Uudelleenkutsu moniajossa][OK]";

/* Alert */
"[2][%ld audio file(s) to be created.|This requires %@ of disk space.][Create|Cancel]" = "[2][%ld äänitiedostoa luodaan.|Tähän tarvitaan %@ levytilaa.][Luo|Kumoa]";

/* Alert */
"[2][\\U201C%@\\U201D has smaller size!|Use anyway?][Cancel|Use]" = "[2][”%@” on kooltaan pienempi!|Käytetäänkö silti?][Kumoa|Käytä]";

/* Alert */
"[2][Audio file \\U201C%@\\U201D not found.][Skip|Search]" = "[2][Äänitiedostoa ”%@” ei löytynyt.][Ohita|Etsi]";

/* Alert */
"[2][Automation data exist for that track.|Do you want to delete the automation data also?][Don\\U2019t Delete Data|Cancel|Delete Data]" = "[2][Tälle raidalle on automaatiotiedot.|Haluatko poistaa myös automaatiotiedot?][Älä poista tietoja|Kumoa|Poista tiedot]";

/* Alert */
"[2][Burn process succeeded][OK]" = "[2][Poltto onnistui][OK]";

/* Alert */
"[2][Delete existing settings?][Cancel|Delete]" = "[2][Poista olemassa olevat asetukset?][Kumoa|Poista]";

/* EXS24 */
"[2][Delete instrument \\U201C%@\\U201D ?][Cancel|Delete%@]" = "[2][Poistetaanko instrumentti ”%@” ?][Kumoa|Poista%@]";

/* Alert */
"[2][Delete recorded audio file \\U201C%@\\U201D%@ from disk?|Can\\U2019t UNDO this operation!][Delete|Keep%@]" = "[2][Poistetaanko tallennettu äänitiedosto ”%@”%@ levyltä?|Toimintoa ei voida PERUA!][Poista|Säilytä%@]";

/* HyperDraw / Automation */
"[2][Do you want to delete the automation data?][No|Delete]" = "[2][Haluatko poistaa automaatiotiedot?][Ei|Poista]";

/* Alert */
"[2][File \\U201C%@\\U201D exists.][Cancel|Replace]" = "[2][Tiedosto ”%@” on olemassa.][Kumoa|Korvaa]";

/* Alert */
"[2][Last Operation exceeds Folder or Region Beginning!|Adapt Size?][Cancel|Adapt]" = "[2][Viimeisin toiminto ylittää kansion tai alueen alun.|Mukauta koko?][Kumoa|Mukauta]";

/* Alert */
"[2][Last operation exceeds folder or region length.|Adapt Size?][Cancel|Adapt]" = "[2][Viimeisin toiminto ylittää kansion tai alueen pituuden.|Mukauta koko?][Kumoa|Mukauta]";

/* Alert */
"[2][Launch the \\U201C%@\\U201D driver?][Yes|No]" = "[2][Käynnistetäänkö ajuri ”%@”?][Kyllä|Ei]";

/* Alert */
"[2][Overwrite existing settings?][Cancel|Overwrite]" = "[2][Korvaa aiemmat asetukset?][Kumoa|Korvaa]";

/* Alert */
"[2][Part of the project was not played|This project has too many tracks, effects, or notes to be played in real-time.|To optimize performance, see the 'Optimizing GarageBand performance' page in GarageBand Help.][Continue]" = "[2][Osaa projektista ei toistettu|Projektissa on liikaa raitoja, tehosteita tai nuotteja reaaliaikaista toistoa varten.|Voit parantaa suorituskykyä tutustumalla GarageBand-ohjeiden GarageBandin suorituskyvyn parantaminen -sivuun.][Jatka]";

/* Paste in Environment */
"[2][Replace Current Selection?][No|Replace]" = "[2][Korvataanko nykyinen valinta?][Ei|Korvaa]";

/* Alert */
"[2][Simulation succeeded][OK]" = "[2][Simulointi onnistui][OK]";

/* Alert */
"[2][The 32-Bit AU Server has quit unexpectedly.|Any unsaved changes to Audio Unit plug-in parameters are lost. You can try to relaunch the 32-Bit AU Server. In case of repeated issues, click Cancel, then quit and relaunch ^P.][Cancel|Relaunch 32-Bit AU Server]" = "[2][32-bittinen AU-palvelin lopetti yllättäen toimintansa.|Tallentamattomat muutokset Audio Unit -liitännäisen parametreihin menetetään. Yritä avata 32-bittinen AU-palvelin uudelleen. Jos ongelma jatkuu, osoita Kumoa, lopeta ja avaa ^P uudelleen.][Kumoa|Avaa 32-bittinen AU-palvelin uudelleen]";

/* Alert */
"[2][The destination format does not support sample rates above 48kHz.|^P can convert the bounced data\\U2019s sample rate. Do you want this?][Cancel|Convert]" = "[2][Kohdemuoto ei tue yli 48 kHz näytetaajuuksia.|^P voi muuntaa palautetun datan näytetaajuutta. Tehdäänkö tämä?][Kumoa|Muunna]";

/* Alert */
"[2][The File \\U201C%@\\U201D could not be opened, because it is in the Trash.|To use this item, first drag it out of the Trash.][OK]" = "[2][Tiedostoa ”%@” ei voitu avata, koska se on roskakorissa.|Käyttääksesi tiedostoa, vedä se ensin pois roskakorista.][OK]";

/* Alert */
"[3][Couldn\\U2019t create Launch!][ABORT]" = "[3][Aloitusta ei voida luoda!][KESKEYTÄ]";

/* Alert */
"[3][Couldn\\U2019t create Region][Cancel]" = "[3][Aluetta ei voitu luoda][Kumoa]";

/* Alert */
"[3][Couldn\\U2019t record Events!|Reorganize memory?|%ld,%ld,%ld][OK|Reorganize]" = "[3][Tapahtumia ei voitu tallentaa.|Järjestetäänkö muisti uudelleen?|%ld,%ld,%ld][OK|Järjestä uudelleen]";

/* Alert */
"[3][Illegal Region (2)][Repair|OK]" = "[3][Virheellinen alue (2)][Korjaa|OK]";

/* Alert */
"[3][Illegal Region number][Cancel]" = "[3][Virheellinen alueen numero][Kumoa]";

/* Alert */
"[3][Low memory situation!|(Not enough master pointers)][OK]" = "[3][Muisti on vähissä.|(Liian vähän master-osoittimia)][OK]";

/* Alert */
"[3][MIDI Out error][OK]" = "[3][MIDI-ulostulovirhe][OK]";

/* Alert */
"[3][MIDI timeout|^P has detected a MIDI timeout. Please restart your computer, then relaunch ^P.|If the problem persists, update the drivers of all connected MIDI devices (including audio drivers with MIDI functionality) to the latest version. For instructions on removing older drivers, consult the manufacturers' documentation.][OK]" = "[3][MIDI-aikakatkaisu|^P havaitsi MIDI-aikakatkaisun. Käynnistä tietokone uudelleen ja avaa ^P uudelleen.|Jos ongelma jatkuu, päivitä kaikkien liitettyjen MIDI-laitteiden (mukaan lukien ääniajurien, joissa on MIDI-toiminnallisuus) ajurit uusimpiin versioihinsa. Ohjeita vanhempien ajurien poistamiseen saat valmistajien dokumentaatiosta.][OK]";

/* Alert */
"[3][Minor problem in data (3)][Repair|OK]" = "[3][Pieni ongelma datassa (3)][Korjaa|OK]";

/* Alert */
"[3][Module file \\U201C%@\\U201D is outdated and cannot be used with this version of ^P.|Please get an update of the Module file and move it to the \\U201C%@\\U201D folder.][OK]" = "[3][Moduulitiedosto ”%@” on vanhentunut eikä sitä voida käyttää ohjelman ”^P” tämän version kanssa.|Hanki päivitetty moduulitiedosto ja siirrä se kansioon ”%@”.][OK]";

/* Alert */
"[3][Module file \\U201C%@\\U201D is too new and cannot be used with this version of ^P.|Please get an update of the ^P application file.][OK]" = "[3][Moduulitiedosto ”%@” on liian uusi eikä sitä voida käyttää ohjelman ”^P” tämän version kanssa.|Hanki päivitetty ohjelmatiedosto ”^P”.][OK]";

/* Alert */
"[3][No matching data on clipboard!][Abort]" = "[3][Vastaavaa dataa ei ole leikepöydällä!][Keskeytä]";

/* Alert */
"[3][No Recording Track specified!][ABORT]" = "[3][Äänitysraitaa ei ole määritetty!][KESKEYTÄ]";

/* Alert */
"[3][No Recording Track specified!][Cancel]" = "[3][Tallennusraitaa ei ole määritetty.][Kumoa]";

/* Alert */
"[3][Not enough memory for a new project][Abort]" = "[3][Liian vähän muistia uudelle projektille][Keskeytä]";

/* Alert */
"[3][Not enough memory to create clipboard!][Abort]" = "[3][Ei tarpeeksi muistia leikepöydän luomiseen!][Keskeytä]";

/* Alert */
"[3][Not enough memory to create clipboard/Undo!|Should never happen.][Abort]" = "[3][Ei tarpeeksi muistia leikepöydän luomiseen/perumiseen!|Tätä ei pitäisi koskaan tapahtua.][Keskeytä]";

/* Alert */
"[3][Not enough memory to create object][Abort]" = "[3][Ei tarpeeksi muistia kohteen luomiseen][Keskeytä]";

/* Alert */
"[3][Not enough Memory|(playtracks)][Abort]" = "[3][Liian vähän muistia|(toistoraidat)][Keskeytä]";

/* Alert */
"[3][Read Error!|This is not a ^P project!][Abort]" = "[3][Lukuvirhe!|Tämä ei ole ohjelman ^P projekti.][Keskeytä]";

/* Alert */
"[3][Sorry, too old project format!][Abort]" = "[3][Projektin muoto on liian vanha.][Keskeytä]";

/* Alert */
"[3][There are Regions in this track!|Delete Track and Regions?][Cancel|OK]" = "[3][Raidassa on alueita.|Poista raita ja alueet?][Kumoa|OK]";

/* Alert */
"[3][Unknown Undo type][Abort]" = "[3][Tuntematon perumistyyppi][Keskeytä]";

/* Alert */
"[3][Warning! Not enough memory!|This operation cannot be undone.][OK]" = "[3][Varoitus! Liian vähän muistia.|Toimintoa ei voida perua.][OK]";

/* Alert */
"[3][Warning!|Project may be damaged][OK]" = "[3][Varoitus!|Projekti saattaa olla vioittunut][OK]";

/* Alert */
"[3][Wrong Version!][Abort]" = "[3][Väärä versio!][Keskeytä]";

/* Alert */
"[3][You have an old Emagic USB MIDI Driver version installed.|This can cause unreliable MIDI communication and crashes. Please install version 1.5 or higher. You can find the current version on www.emagic.de.][OK]" = "[3][Asennettuna on vanha Emagicin USB-MIDI-ohjaimen versio.|Tämä saattaa aiheuttaa epäluotettavaa MIDI-toimintaa ja kaatumisia. Asenna versio 1.5 tai uudempi. Uusin versio löytyy osoitteesta www.emagic.de.][OK]";

/* Alert */
"[Continue]" = "[Jatka]";

/* media type */
"CD-ROM" = "CD-ROM";

/* media type, cd-recordable */
"CDR" = "CD-R";

/* media type, cd-rewritable */
"CDRW" = "CD-RW";

/* Node */
"Connected to" = "Liittyy";

/* media type, dvd-recordable */
"DVD+R" = "DVD+R";

/* media type, dvd-recordable */
"DVD+R Dual Layer" = "DVD+R Dual Layer";

/* media type, dvd-rewritable */
"DVD+RW" = "DVD+RW";

/* media type, dvd-recordable */
"DVD-R" = "DVD-R";

/* media type */
"DVD-RAM" = "DVD-RAM";

/* media type */
"DVD-ROM" = "DVD-ROM";

/* media type, dvd-rewritable */
"DVD-RW" = "DVD-RW";

/* Freeze: Disk Full Alert: see Ke6 */
"for creating freeze file(s)." = "jäädytystiedostojen luomista varten.";

/* cd/dvd media status display - drive is spinning up/down */
"In Transition..." = "Liikkeessä...";

/* Progress Bar */
"Loading Audio Files for \\U201C%@\\U201D..." = "Ladataan äänitiedostoja kohteelle ”%@”...";

/* cd/dvd media status display */
"No media" = "Ei mediaa";

/* Node */
"Not connected" = "Ei yhteydessä";

/* Control surface feedback */
"There is a modal dialog on the screen." = "Näytöllä on modaalinen valintaikkuna.";

/* cd/dvd media status display - status itself is unknown */
"Unknown" = "Tuntematon";

/* cd/dvd media status display */
"Unknown media type" = "Tuntematon mediatyyppi";

/* Default AU program name
   Default Factory Setting name */
"Untitled" = "Nimetön";

